
#include <iostream>    

int main() {
    system("chcp 65001");
    double num_1;   // первое число
    double num_2;   // второе число
    double average;   // результат — среднее

    // Запрашиваем первое число
    std::cout << "Введите первое число:";
    std::cin >> num_1;

    // Запрашиваем второе число
    std::cout << "Введите второе число:";
    std::cin >> num_2;

    // Считаем среднее. Пишем 2.0, а не 2,
    // чтобы деление было вещественным, а не целочисленным.
    average = (num_1 + num_2) / 2.0;

    // Выводим результат
    std::cout << "Среднее: " << average << '\n';

    return 0;   // 0 = успешное завершение программы
}
